src/InformationRegisters/Пайплайны/Пайплайны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Пайплайны</name>
  <resources>
    <name>Сборка</name>
    <type>
      <types>CatalogRef.Сборки</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПайплайнов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДобавленияВОчередь</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Лог</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрлСостоянияJob</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдачныеТесты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеудачныеТесты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <predefined>
    <items>
      <name>Неопределен</name>
      <description>Неопределен</description>
    </items>
  </predefined>
  <attributes>
    <name>URLGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПроектаGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PathGitClone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботыКонфигурации</name>
    <type>
      <types>EnumRef.РежимыРаботыКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевПроекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСборкиРелиза</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевШара</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьКонфигурациюВРелиз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяJobJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаАктуальныхОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДляАктуализацииОбработок</name>
    <type>
      <types>CatalogRef.Базы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаРасширенийДляАктуализацииОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРепозитория</name>
    <type>
      <types>EnumRef.ТипРепозитория</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ПрефиксВетки</name>
    <type>
      <types>CatalogRef.ПрефиксыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДорабатыватьКонфигурацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаGitLab</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Стадия</name>
    <type>
      <types>CatalogRef.СтадииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачи</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>CatalogRef.Спринты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиБазовой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПланировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьКрайнийСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ToolsWorld</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Aelita</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазовойЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияБазовойЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиИтилиум</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРелиза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаMergeRequest</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеФайлы</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КасаемыеПроцессы</name>
    <attributes>
      <name>Процесс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяПроцесса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>ИДКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спринты</name>
    <attributes>
      <name>Спринт</name>
      <type>
        <types>CatalogRef.Спринты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпринтРазработки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФактическиеТрудозатраты</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатраченноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗадачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ЗапускПриложенияЧерезJENKINS/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Инициатор

Процедура ЗапускПриложения(ПараметрыЗапуска) Экспорт	

	ЮрлЗапускаJob = ПараметрыЗапуска.СтрокаКоманды;

	Ответ = КоннекторHTTP.Get(ЮрлЗапускаJob,
		ПараметрыЗапуска.ПараметрыЗапроса,
		ПараметрыЗапуска.ДополнительныеПараметрыЗапроса
	);
	
	Location = Ответ.Заголовки["Location"];
	Если ЗначениеЗаполнено(Location) Тогда
		ЮрлСостоянияJob = СтрШаблон("%1api/json", Location);
		РегистрыСведений.Пайплайны.ДобавитьЮрлСостояния(ПараметрыЗапуска.UID, ЮрлСостоянияJob);	
	КонецЕсли;

	
КонецПроцедуры

Процедура ПолучитьВывод(ПараметрыЗапускаПрограммы) Экспорт
 
	ЮрлВыводаЛогаJob = СтрШаблон("%1/job/%2/%3/logText/progressiveText?start=0",
		ПараметрыЗапускаПрограммы.URLJenkins,
		ПараметрыЗапускаПрограммы.ИмяJobJenkins, 
		ПараметрыЗапускаПрограммы.НомерJob
	);

	Ответ = КоннекторHTTP.Get(ЮрлВыводаЛогаJob,, ПараметрыЗапускаПрограммы.ДополнительныеПараметрыЗапроса);

	Если Не ЗначениеЗаполнено(ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВыводаНаСервере) Тогда
		ПутьКПапке = Константы.ПутьКПапкеДевопсСервера.Получить();
		ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВыводаНаСервере = СтратегияЗапускаСкриптов.ИмяВременногоФайла(ПутьКПапке);
	КонецЕсли;
		
	ФайлTXT = Новый ТекстовыйДокумент;
	ФайлTXT.УстановитьТекст(КоннекторHTTP.КакТекст(Ответ));
	ФайлTXT.Записать(ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВыводаНаСервере, "CP866");
	
КонецПроцедуры

Процедура ПолучитьВыводПоСборке(Пайплайн) Экспорт
	
	ПараметрыЗапуска = ПодготовкаПараметров(Пайплайн);

	ЮрлВыводаЛогаJob = СтрШаблон("%1/job/%2/%3/logText/progressiveText?start=0",
		ПараметрыЗапуска.URLJenkins,
		ПараметрыЗапуска.ИмяJobJenkins, 
		Пайплайн.НомерJob
	);

	Ответ = КоннекторHTTP.Get(ЮрлВыводаЛогаJob,, ПараметрыЗапуска.ДополнительныеПараметрыЗапроса);
		
	ТекстСборки = КоннекторHTTP.КакТекст(Ответ);
	Если СтрНайти(ТекстСборки, ОбщегоНазначенияУправлениеРазработкой.ТекстОкончанияКоманды()) Тогда
		РегистрыСведений.Пайплайны.ЗафиксироватьВыполнениеСборки(ПараметрыЗапуска.UID, ТекстСборки);
	Иначе
		РегистрыСведений.Пайплайны.ЗафиксироватьЛоги(ПараметрыЗапуска.UID, ТекстСборки);
	КонецЕсли;

	
КонецПроцедуры
#КонецОбласти

// Конструктор параметров для ЗапуститьПрограмму.
//
// Возвращаемое значение:
//  Структура:
//    * ТекущийКаталог - Строка - задает текущий каталог запускаемого приложения.
//    * ДождатьсяЗавершения - Булево - Ложь - дожидаться завершения запущенного приложения 
//         перед продолжением работы.
//    * ПолучитьПотокВывода - Булево - Ложь - результат, направленный в поток stdout,
//         если не указан ДождатьсяЗавершения - игнорируется.
//    * ПолучитьПотокОшибок - Булево - Ложь - ошибки, направленные в поток stderr,
//         если не указан ДождатьсяЗавершения - игнорируется.
//    * КодировкаПотоков - КодировкаТекста
//                       - Строка - кодировка, используемая для чтения stdout и stderr.
//         По умолчанию используется для Windows "CP866", для остальных - "UTF-8".
//    * КодировкаИсполнения - Строка
//                          - Число - кодировка, устанавливаемая в Windows с помощью команды chcp,
//             возможные значения: "OEM", "CP866", "UTF8" или номер кодовой страницы.
//         В Linux устанавливается переменной окружения "LANGUAGE" для конкретной команды,
//             возможные значения можно определить выполнив команду "locale -a", например "ru_RU.UTF-8".
//         В MacOS игнорируется.
//    * ЮРЛАгента - Путь к базе которая запускает скрипт на удаленном сервере.
//
Функция ПараметрыЗапускаПрограммы() Экспорт
	
	Параметры = СтратегияЗапускаСкриптов.ПараметрыЗапускаПрограммы();
	Параметры.СтратегияЗапуска = "Jenkins";            
	Параметры.UID = "";            
	
	Возврат Параметры;
	
КонецФункции

Функция ПодготовкаПараметровИЗапускПриложения(База, Задача, Команда) Экспорт
	
	СтрокаКоманды = ОбщегоНазначенияСлужебныйКлиентСервер.БезопаснаяСтрокаКоманды(Команда);
	НастройкиБазы = РаботаСGitAPIПовтИсп.НастройкиБазы(База);
	
	ПараметрыЗапуска = ПараметрыЗапускаПрограммы();
	ПараметрыЗапуска.КомандаЗапуска = Команда;
	ПараметрыЗапуска.СтрокаКоманды = СтрокаКоманды;
	ПараметрыЗапуска.ПутьКПапкеДевопс = НастройкиБазы.ПутьКПапкеДевопс;
	ПараметрыЗапуска.ПараметрыЗапроса = НовыйПараметрыЗапроса();
	ПараметрыЗапуска.ДополнительныеПараметрыЗапроса = НовыйДополнительныеПараметрыЗапроса();
	ПараметрыЗапуска.URLJenkins = НастройкиБазы.URLJenkins;
	ПараметрыЗапуска.ИмяJobJenkins = НастройкиБазы.ИмяJobJenkins;
	
	ЗаполнитьПараметрыЗапроса(ПараметрыЗапуска.ПараметрыЗапроса, Задача, НастройкиБазы);
	ЗаполнитьДополнительныеПараметрыЗапроса(ПараметрыЗапуска.ДополнительныеПараметрыЗапроса, НастройкиБазы);

	ЗапускПриложения(ПараметрыЗапуска);
	
	Возврат ПараметрыЗапуска;
	
КонецФункции

Функция ПодготовкаПараметров(Пайплайн)
	
	Задача = Пайплайн.Задача;

	ПараметрыПроекта = Справочники.Проекты.НастройкиПроекта(Задача.Владелец); 
	ЮрлЗапускаJob = СтрШаблон("%1/job/%2/buildWithParameters",
		ПараметрыПроекта.URLJenkins,
		ПараметрыПроекта.ИмяJobJenkins
	);
	
	ПараметрыЗапуска = ПараметрыЗапускаПрограммы();
	ПараметрыЗапуска.UID = Пайплайн.UID;
	ПараметрыЗапуска.КомандаЗапуска = ЮрлЗапускаJob;
	ПараметрыЗапуска.СтрокаКоманды = ЮрлЗапускаJob;
	ПараметрыЗапуска.ПараметрыЗапроса = НовыйПараметрыЗапроса();
	ПараметрыЗапуска.ДополнительныеПараметрыЗапроса = НовыйДополнительныеПараметрыЗапроса();
	ПараметрыЗапуска.URLJenkins = ПараметрыПроекта.URLJenkins;
	ПараметрыЗапуска.ИмяJobJenkins = ПараметрыПроекта.ИмяJobJenkins;
	
	ЗаполнитьПараметрыЗапроса(ПараметрыЗапуска.ПараметрыЗапроса, Задача, ПараметрыПроекта);
	ЗаполнитьДополнительныеПараметрыЗапроса(ПараметрыЗапуска.ДополнительныеПараметрыЗапроса, ПараметрыПроекта);

	Возврат ПараметрыЗапуска;
	
КонецФункции

Процедура ЗапускПриложенияПоЗадаче(Пайплайн) Экспорт
	
	ПараметрыЗапуска = ПодготовкаПараметров(Пайплайн);
	ЗапускПриложения(ПараметрыЗапуска);
		
КонецПроцедуры

Процедура ПроверитьСтартПайплайна(Пайплайн) Экспорт

	ЮрлСостоянияJob = Пайплайн.ЮрлСостоянияJob; 
	ПараметрыЗапуска = ПодготовкаПараметров(Пайплайн);
	ОтветЗапускаJob = КоннекторHTTP.GetJson(ЮрлСостоянияJob,, ПараметрыЗапуска.ДополнительныеПараметрыЗапроса);
	Если ОтветЗапускаJob["executable"] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.Пайплайны.ДобавитьНомерJob(Пайплайн.UID, ОтветЗапускаJob["executable"]["number"]);
	
КонецПроцедуры

Процедура ПрочитатьОтчетПайплайнаAllure(Пайплайн) Экспорт
	
	ПараметрыЗапуска = ПодготовкаПараметров(Пайплайн);
	
	Адрес  = "http://jenkins.toolsworld.root.local/job/%1/%2/artifact/allure-report.zip";
	Адрес = СтрШаблон(Адрес, ПараметрыЗапуска.ИмяJobJenkins, Пайплайн.НомерJob);
	ИтогиТестов = РазобратьОтчетAllureПоВнешнимДанным(Адрес, ПараметрыЗапуска.ДополнительныеПараметрыЗапроса, Пайплайн);
	
	РегистрыСведений.Пайплайны.ЗаписатьРезультатТеста(Пайплайн, ИтогиТестов);

	СсылкаНаТест = РаботаСJenkins.СсылкаAllure(ПараметрыЗапуска.URLJenkins, ПараметрыЗапуска.ИмяJobJenkins, Пайплайн.НомерJob);
	РаботаСBitrix.ДобавитьКомментариемРезультатыТестов(СсылкаНаТест, ИтогиТестов["КоличествоУспешных"], ИтогиТестов["КоличествоОшибок"], Пайплайн.Задача);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция РазобратьОтчетAllureПоВнешнимДанным(Адрес, ДополнительныеПараметры, Пайплайн)
	
	Ответ = КоннекторHTTP.Get(Адрес,, ДополнительныеПараметры);
	ИтогиТестов = ИтогиТестов();

	Попытка
		ЧтениеZip = Новый ЧтениеZipФайла(Ответ.Тело.ОткрытьПотокДляЧтения());
	Исключение
		Возврат ИтогиТестов;
	КонецПопытки;
	
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл
		
		Если Элемент.Имя = "suites.json" Тогда
			ВременнаяПапка = ПолучитьИмяВременногоФайла();
			ЧтениеZip.Извлечь(Элемент, ВременнаяПапка);
			
			ШаблонПути = "%1\allure-report\data\%2";
			ПутьКФайлу = СтрШаблон(ШаблонПути, ВременнаяПапка, Элемент.Имя);
			
			Отчет = ЗначениеТекстовогоФайла(ПутьКФайлу);
			ДанныеОтчета = ОбщегоНазначения.JSONВЗначение(Отчет,, Истина);
			
			ИтогиТестов = РазобратьОтчетAllure(ДанныеОтчета);
			УдалитьФайлы(ПутьКФайлу);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИтогиТестов;
	
КонецФункции

Функция РазобратьОтчетAllure(ДанныеОтчета)
	
	ИтогиТестов = Новый Структура;
	
	СтатусыТестов = СтатусыТестов();
	
	Для Каждого Элемент Из СтатусыТестов Цикл
        ИтогиТестов.Вставить(Элемент.Значение, 0);
    КонецЦикла;
	
	Для каждого Тест Из ДанныеОтчета["children"] Цикл
		ИтогиТестов[СтатусыТестов[Тест["status"]]] = ИтогиТестов[СтатусыТестов[Тест["status"]]] + 1;
	КонецЦикла;
	
	Возврат ИтогиТестов;
	
КонецФункции

Функция СтатусыТестов()
	
	Результат = Новый Соответствие();
	Результат.Вставить("passed", "КоличествоУспешных");
	Результат.Вставить("failed", "КоличествоОшибок");
	Результат.Вставить("skipped", "КоличествоПропущенных");
	Результат.Вставить("broken", "КоличествоПровалов");
	
	Возврат Результат;
	
КонецФункции

Функция ИтогиТестов()
	
	Результат = Новый Соответствие();
	Результат.Вставить("КоличествоУспешных", 0);
	Результат.Вставить("КоличествоОшибок", 0);
	Результат.Вставить("КоличествоПропущенных", 0);
	Результат.Вставить("КоличествоПровалов", 0);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеТекстовогоФайла(ПутьКФайлу)
	
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	Значение = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Возврат Значение;

КонецФункции

Функция НовыйПараметрыЗапроса() Экспорт
	
	ПараметрыЗапроса = Новый Структура;

	ПараметрыЗапроса.Вставить("token", "");
	ПараметрыЗапроса.Вставить("BRANCHE_NAME", "");
	ПараметрыЗапроса.Вставить("CATALOG_TEST", "");
	ПараметрыЗапроса.Вставить("NAMES_DATA_PROCESSORS", "");
	ПараметрыЗапроса.Вставить("RUN_STAGE", Ложь);
	ПараметрыЗапроса.Вставить("NEED_UPDATE_IB", Ложь);
	ПараметрыЗапроса.Вставить("EXTENSION_NAME", ""); 
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция НовыйДополнительныеПараметрыЗапроса() Экспорт
	
	ДополнительныеПараметрыЗапроса = Новый Структура;
	ДополнительныеПараметрыЗапроса.Вставить("Аутентификация", Новый Структура("Пользователь, Пароль", "", ""));
	
	Возврат ДополнительныеПараметрыЗапроса;
	
КонецФункции

Процедура ЗаполнитьПараметрыЗапроса(ПараметрыЗапроса, Задача, ПараметрыПроекта) Экспорт

	ВеткаЗадачи = Справочники.Задачи.ВеткаЗадачи(Задача);
    ВеткаЗадачи = СтрШаблон("*/%1", ВеткаЗадачи); 
	
	ПараметрыЗадачи = Справочники.Задачи.РеквизитыЗадачи(Задача);
	ВнешниеФайлы = ПараметрыЗадачи.ВнешниеФайлы;
	
	ПараметрыЗапроса.token = ПараметрыПроекта.ТокенJenkins;
	ПараметрыЗапроса.BRANCHE_NAME = ВеткаЗадачи;
	ПараметрыЗапроса.NAMES_DATA_PROCESSORS = ВнешниеФайлы;
	ПараметрыЗапроса.EXTENSION_NAME = Справочники.Задачи.РасширенияЧерезЗапятую(Задача); 
	ПараметрыЗапроса.NEED_UPDATE_IB = Задача.ДорабатыватьКонфигурацию;
	CATALOG_TEST = Справочники.Задачи.КаталогиТестовЧерезЗапятую(Задача);
	Если ПустаяСтрока(CATALOG_TEST) Тогда
		CATALOG_TEST = "feature\smoke"; 
	КонецЕсли;
	ПараметрыЗапроса.CATALOG_TEST = CATALOG_TEST;
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеПараметрыЗапроса(ДополнительныеПараметрыЗапроса, НастройкиБазы) Экспорт
	
	ДополнительныеПараметрыЗапроса.Аутентификация.Пользователь = НастройкиБазы.ИмяПользователяJenkins;
	ДополнительныеПараметрыЗапроса.Аутентификация.Пароль = НастройкиБазы.ПарольJenkins;
		
КонецПроцедуры

#КонецОбласти
